// © Copyright 2012-2013, 2015-2016 HP Development Company, L.P.

// Task name & description
HSDTaskName = "Paramètres du serveur Proxy";
HSDTaskDescription = "L'imprimante prend en charge la connexion à Internet. Si vous utilisez un serveur Proxy pour vous connecter à Internet, configurez les paramètres ci-dessous.";
TaskDescriptionInAssistantMode = "Pour vous connecter aux Services Web HP, votre imprimante doit se connecter à Internet. Si vous utilisez un serveur proxy pour vous connecter à Internet, entrez les paramètres ci-dessous.\n\nSi vous ne connaissez pas vos paramètres proxy, reportez-vous aux paramètres figurant dans le volet des préférences réseau ou adressez-vous à votre administrateur système.";

// Radio buttons matrix
HSDProxyServerNotRequiredTitle = "Le serveur Proxy n'est pas obligatoire pour établir la connexion à Internet";
HSDAutomaticProxySettingsTitle = "Automatique (le périphérique détectera les paramètres automatiquement)";
HSDCustomProxySettingsTitle = "Configuration personnalisée du serveur Proxy :";
HSDSystemProxySettingsTitle = "Copier les paramètres système";

// Proxy server settings
HSDProxyServerTitle = "Serveur Proxy :";
ProxyPortTitle = "Port Proxy :";

// Authentication
HSDRequiresAuthenticationButton = "Le serveur Proxy requiert une authentification";
HSDUserNameTitle = "Nom d'utilisateur :";
HSDPasswordTitle = "Mot de passe :";

HSDApplyNowButtonTitle = "Appliquer maintenant";

// progress titles
UpdateInformationProcessTitle = "Mise à jour des informations en cours...";

// alerts
EmptyProxyServerOrPortErrorText = "Le serveur Proxy et le port Proxy doivent être spécifiés ensemble.";

EmptyUserNameOrPasswordErrorText = "L'authentification sur le serveur Proxy requiert la spécification du nom d'utilisateur et du mot de passe.";

IncorrectProxyServerNameFormatErrorText = "Échec de la configuration du nom du serveur proxy. Vérifiez si le format est correct.";

HSDUserNameTooLargeErrorText = "Le nom d'utilisateur est trop long. Votre périphérique prend en charge les noms d'utilisateur d'au plus %d caractères.";
